{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": "2013-11-14T10:17:57.76-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The user has a choice to start by creating a \"Property / Attribute Weighting Hierarchy = Decision Hierarchy \" or to define the site or to do a little of each {might need a wizard for this}. The goal is to have a at least one site and one decision hierarchy.\n \nUser Case to define the Decision Hierarchy\nPrequisite: At least one site and one property exist, otherwise a dialog is presented to the use to create a site and/or property.\n1. User opens the Decision Hierarchy window (list of properties by name appear vertically on the left)\n2. User defines the name of the hierarchy\n3. User defines the set of level one categories (restricted to 9 or less categories)\n4.1 User defines the weights for each category. Note: weights at any category level always sum to 100%\nOR\n4.2 User defines subcategories (restricted to 9 or less categories per parent category)\n5. At the leaf level, the user drags site properties from the property panel into the category tree\n6. User continues the process until a full set of categories, properties, their weights are defined\n7. User clicks the utility function icon located adjacent to each leaf node.\n8. PVMapper open the utility function parameterization window\n9. The user modifies the utility function values to represent her preferences for the site property\n10. User saves the defined utility function, which is now connected to the particular site property\n11. User repeats defining utility functions for all leaf nodes in the decision hierarchy\n \n------------------------------------------------------------------------------------------------------\nCase where the company has calculated site properties outside of PVMapper\n1. see use case for User Site Property feature\n------------------------------------------------------------------------------------------------------\nAs the user makes changes to the site the following will occur.\n1. On the event of any changes to any site.\n2. PVMapper will update the property calculations, utility values, weighted utility values, and overall site scores\n------------------------------------------------------------------------------------------------------\nSite scores are calclated in the following way.\n1. Properties are recalculated\n2. Utility values are recalculated\n3. Utility values are multiplied by global leaf weights\n4. Weighted leaf utility values are summed to the parent level\n5. Parents are summed to their parents until finally resulting in a site score\n \n------ Content of PVMapper 1.0 Concept of Operations and Funcational Specifications Document ---------\nThe Site Comparisons feature provides the user with side-by-side comparisons of costs and benefits among sites that have been analyzed by PVMapper.\nRequired data: All summary data generated by PVMapper will be potentially used in this comparison tool . \nPre-condition: \n·         User is in Project Workspace mode and more than 1 site is available and has defined cost information.\nUse Cases: \n·         User selects multiple sites in the project browser and clicks the “Add to Comparison” button.  PVMapper creates a table with costs (rows) vs. sites (columns), where the first column is an “include” check box, second the cost item name, third is a weight input field (integer 0-1), followed by a column for each site to be compared (user defined) and finally two columns for the mean and standard deviation of the row values across sites. The first row contains the site names and the second contains the site overall score.\n·         User can select which cost items to compare row by row by selecting the first column check box. Note, this feature promotes fair comparisons among sites since some cost items may not have complete data.\n·         User can define a weight (0 -1) for each cost item by editing the newly created table.\n·         User can select “Scale Comparisons” and PVMapper will create a new table where site values are transformed by the formula (x – mean)/standard deviation.  PVMapper will multiply each value by its row score, sum the column and put the resulting site score in the second row of the table immediately under the site name.\n·         User can define a utility function for each cost (row).\n·         User can select “Utility Comparison” and PVMapper will create a new table where site values are transformed by the user defined utility function.  PVMapper will multiply each value by its row score, sum the column and put the resulting site score in the second row of the table immediately under the site name.\n·         User selects “Rank Sites” and PVMapper will rearrange the table (Scale Comparisons or Utility Comparisons) columns from left to right in descending order by the site score.\nFunctional Requirements:\n·         PVMapper will allow the user to compare multiple sites based on estimated values, scaled estimates, and utility transformed estimates. \n·         PVMapper will calculate an overall site score\n·         PVMapper will calculate the buffer zone cost based on a user defined land cost.\n·         Additional metrics to include in the summary comparison table can be added by plugins.\nPerformance Requirements:\n·         This functionality should be relatively instantaneous because each cost value could be precalcualted by their respective plugins. Alternatively plugins could generate cost values for their respective cost metrics “on-the-fly” based on existing site information.",
    "LastUpdatedDate": "2017-11-27T16:58:06.207-08:00",
    "PlannedForRelease": "Alpha Version Prototype",
    "ReleaseVisibleToPublic": true,
    "Priority": {
      "Name": "High",
      "Severity": 150,
      "Id": 3
    },
    "ProjectName": "pvmapper",
    "ReportedDate": "2012-08-29T14:24:52.433-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Site Comparison",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 0,
    "Id": 23236
  },
  "FileAttachments": [],
  "Comments": []
}